w8/d1/redditclone/app/controllers/subs_controller.rb

    def show
        @sub = Sub.find(params[:id])
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @sub = current_user.subs.new(sub_params)
        if @sub.save
---
INSERT INTO "subs" ("created_at", "updated_at", "title", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-09-14 23:15:40.571960"], ["updated_at", "2020-09-14 23:15:40.571960"], ["title", "sfdasfasf"], ["description", "asfsafasfd"], ["user_id", "3"]]