w11/d3/benchbnb/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Y3FupIGPkR8hB34HgNAa8w"], ["updated_at", "2020-10-07 22:19:20.355323"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save