w6/d4/art_share/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index

    user = User.find(params[:user_id])

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "The Pizza"], ["image_url", "pizzahut.io"], ["artist_id", 2]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "The Pizza2"], ["id", 7]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
  def destroy
    artwork = Artwork.find(params[:id])
    artwork.destroy