w6/d4/art_share/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)

        if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 3], ["created_at", "2020-09-03 22:01:18.252718"], ["updated_at", "2020-09-03 22:01:18.252718"]]

    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 9]]