w6/d4/art_share/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["artwork_id", 1], ["body", "The Mona Lisa sucks"], ["created_at", "2020-09-03 23:24:04.527798"], ["updated_at", "2020-09-03 23:24:04.527798"]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]
---
  def destroy
    comment = Comment.find(params[:id])
    comment.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments"
---
  def index
    if params.has_key?(:comment)
      if params[:comment].has_key?(:user_id)
        user = User.find(params[:comment][:user_id])
        render json: user.comments
      elsif params[:comment].has_key?(:artwork_id)
        artwork = Artwork.find(params[:comment][:artwork_id])
        render json: artwork.comments
      end
    else
      comments = Comment.all