w6/d4/art_share/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Beethoven"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        # render plain: "I'm in the index action!"
        # debugger
        if params.has_key?(:name)
            users = User.find_by({:username=>params[:name]})
        else
            users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Kevin Su"], ["updated_at", "2020-09-02 23:07:45.662617"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)