w6/d3/art_share/app/controllers/users_controller.rb

    def index
        # render plain: "I'm in the index action!"
        users = User.all
---
SELECT "users".* FROM "users"

    def update
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Kevin Su"], ["updated_at", "2020-09-02 23:07:45.662617"], ["id", 1]]

    def destroy
        User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]