w6/d5/99_cats/ninetynine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    @kittens = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @kitty = Cat.find(params[:id])

INSERT INTO "cats" ("color", "name", "gender", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["color", "blue"], ["name", "asfdlj"], ["gender", "M"], ["description", "Cheeseburger"], ["created_at", "2020-09-04 23:15:27.566191"], ["updated_at", "2020-09-04 23:15:27.566191"]]
---
  def create
    @kitty = Cat.new(cats_params)
    if @kitty.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 24]]
---
  def destroy
    kitty = Cat.find(params[:id])
    kitty.destroy