w11/d3/benchbnb/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "zCtkIW5gvUIThas6LfLYRA"], ["LIMIT", 1]]
---
    def current_user
        # Check for session_token
        return nil unless session[:session_token]

        # Return the user associated with the session_token (if token is valid)
        @current_user ||= User.find_by_session_token(session[:session_token])