w8/d1/redditclone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
---
    <ul>
        <% @sub.posts.each do |post| %>